20260114205830-programming_and_program_design_f91pd.org
:PROPERTIES:
:ID:       fda22288-6fef-47da-bf44-87c86cfe5e68
:END:
#+title: Programming and Program Design F91PD

* Programming and Program Design F91PD

** Learning Objectives
1. Apply best practices in writing and running code for emerging industry problems.
2. Use a modern programming language to design, implement, and test solutions.
3. Apply procedural and OOP principles to produce well-designed, adaptable, and sustainable code.
4. Analyse the applicability of data structures and code design choices to relevant problems and their implications in terms of efficiency of solution.
5. Assess the use of software tools and languages in the design and development of solutions.

*** [[id:22d5a1bb-7a54-4430-9108-7031ffe39f4c][Module 1]]
