20260114205830-programming_and_program_design_f91pd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming and Program Design F91PD</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Programming and Program Design F91PD</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org233d87c">1. Programming and Program Design F91PD</a>
<ul>
<li><a href="#org0176075">1.1. Learning Objectives</a>
<ul>
<li><a href="#orgcd2b98f">1.1.1. Module 1</a></li>
<li><a href="#org13bad41">1.1.2. Module 2</a></li>
<li><a href="#org2283ccb">1.1.3. Module 3</a></li>
<li><a href="#orgcedd64b">1.1.4. Module 4</a></li>
<li><a href="#orgfb89588">1.1.5. Module 5</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org233d87c" class="outline-2">
<h2 id="org233d87c"><span class="section-number-2">1.</span> Programming and Program Design F91PD</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0176075" class="outline-3">
<h3 id="org0176075"><span class="section-number-3">1.1.</span> Learning Objectives</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Apply best practices in writing and running code for emerging industry problems.</li>
<li>Use a modern programming language to design, implement, and test solutions.</li>
<li>Apply procedural and OOP principles to produce well-designed, adaptable, and sustainable code.</li>
<li>Analyse the applicability of data structures and code design choices to relevant problems and their implications in terms of efficiency of solution.</li>
<li>Assess the use of software tools and languages in the design and development of solutions.</li>
</ol>
</div>

<div id="outline-container-orgcd2b98f" class="outline-4">
<h4 id="orgcd2b98f"><span class="section-number-4">1.1.1.</span> <a href="20260116072941-module_1.html#ID-22d5a1bb-7a54-4430-9108-7031ffe39f4c">Module 1</a></h4>
</div>
<div id="outline-container-org13bad41" class="outline-4">
<h4 id="org13bad41"><span class="section-number-4">1.1.2.</span> <a href="20260119191739-module_2.html#ID-50fed138-564c-4595-856a-4b86cd4b7b07">Module 2</a></h4>
</div>
<div id="outline-container-org2283ccb" class="outline-4">
<h4 id="org2283ccb"><span class="section-number-4">1.1.3.</span> <a href="20260125175459-module_3.html#ID-6b28769b-c5f8-44ed-9018-4cef7bc39f87">Module 3</a></h4>
</div>
<div id="outline-container-orgcedd64b" class="outline-4">
<h4 id="orgcedd64b"><span class="section-number-4">1.1.4.</span> <a href="20260131134204-module_4.html#ID-a31ebe52-b774-4eab-b3ce-2dddbdd1df28">Module 4</a></h4>
</div>
<div id="outline-container-orgfb89588" class="outline-4">
<h4 id="orgfb89588"><span class="section-number-4">1.1.5.</span> <a href="20260201143111-module_5.html#ID-81573786-561d-4c9a-838e-e8f8068baf2f">Module 5</a></h4>
</div>
</div>
</div>
</div>
</body>
</html>
